Autodesk.Revit.DB.Analysis.EnergyAnalysisConstruction.Roughness
The roughness value of the construction, from 1 (Very Rough) to 6 (Very Smooth) and -1 when unset.
Since:
2024

Autodesk.Revit.DB.Analysis.EnergyAnalysisConstruction.Absorptance
The absorptance value of the construction.
Remarks:
The absorptance is 0 when no value is found.
Since:
2024

Autodesk.Revit.DB.Analysis.EnergyAnalysisConstruction.ThermalMass
The thermal mass value (Cth-value) of the construction, in J/(m^2*k) (equivalent to kg/(k*s^2)).
Since:
2024

Autodesk.Revit.DB.Analysis.EnergyAnalysisConstruction.ThermalResistance
The thermal resistance value (R-value) of the construction, in K*s^3/kg.
Since:
2024

Autodesk.Revit.DB.Analysis.EnergyAnalysisConstruction.HeatTransferCoefficient
The heat transfer coefficient value (U-value) of the construction, in W/(m^2*K) (equivalent to kg/(k*s^3)).
Since:
2024